{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.15.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "1"}]}}}, "outputs": {"dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/lstm_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_3/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/while/maximum_iterations", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/TensorArrayV2_1/num_elements", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/maximum_iterations", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/model/lstm_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm_2/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm_2/TensorArrayV2_1/num_elements"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/Shape", "op": "Shape", "input": ["input_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/transpose", "op": "Transpose", "input": ["input_1", "StatefulPartitionedCall/model/lstm/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape", "StatefulPartitionedCall/model/lstm/strided_slice/stack", "StatefulPartitionedCall/model/lstm/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/transpose", "StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm/strided_slice", "StatefulPartitionedCall/model/lstm/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm/Shape_1", "StatefulPartitionedCall/model/lstm/strided_slice_1/stack", "StatefulPartitionedCall/model/lstm/strided_slice_1/stack_1", "StatefulPartitionedCall/model/lstm/strided_slice_1/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros_1/packed", "StatefulPartitionedCall/model/lstm/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm/zeros/packed", "StatefulPartitionedCall/model/lstm/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/lstm/TensorArrayV2_1", "^StatefulPartitionedCall/model/lstm/zeros_1", "^StatefulPartitionedCall/model/lstm/zeros", "^StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayV2_1", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros_1", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/strided_slice_1", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/while/loop_counter", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/while/maximum_iterations", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/zeros", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm/time", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_24", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_1", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/model/lstm/while/LoopControlInputs/_27"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_19", "StatefulPartitionedCall/model/lstm/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_21", "StatefulPartitionedCall/model/lstm/while/next_iteration/_60"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_22", "StatefulPartitionedCall/model/lstm/while/next_iteration/_61"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_16", "StatefulPartitionedCall/model/lstm/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_17", "StatefulPartitionedCall/model/lstm/while/next_iteration/_56"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_20", "StatefulPartitionedCall/model/lstm/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_23", "StatefulPartitionedCall/model/lstm/while/next_iteration/_62"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/model/lstm/while/enter/_18", "StatefulPartitionedCall/model/lstm/while/next_iteration/_57"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/cond/_14/model/lstm/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_30", "StatefulPartitionedCall/model/lstm/while/merge/_34", "^StatefulPartitionedCall/model/lstm/while/merge/_35", "^StatefulPartitionedCall/model/lstm/while/enter/_24", "^StatefulPartitionedCall/model/lstm/while/enter/_25", "^StatefulPartitionedCall/model/lstm/while/enter/_26", "^StatefulPartitionedCall/model/lstm/while/merge/_28", "^StatefulPartitionedCall/model/lstm/while/merge/_29", "^StatefulPartitionedCall/model/lstm/while/merge/_31", "^StatefulPartitionedCall/model/lstm/while/merge/_32", "^StatefulPartitionedCall/model/lstm/while/merge/_33"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/LoopCond/_36", "op": "LoopCond", "input": ["StatefulPartitionedCall/model/lstm/while/cond/_14/model/lstm/while/Less"]}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/strided_slice_1_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_34", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/loop_counter_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_28", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/maximum_iterations_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_29", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_1_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_33", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_35", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/time_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_30", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_32", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayV2_1_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/model/lstm/while/merge/_31", "StatefulPartitionedCall/model/lstm/while/LoopCond/_36"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/strided_slice_1_switch/_43"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/loop_counter_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/loop_body_control/_45", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/loop_counter_switch/_37:1"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/maximum_iterations_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_1_switch/_42"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_44"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/time_switch/_39"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_switch/_41"], "attr": {"T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayV2_1_switch/_40"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_44", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayV2_1_switch/_40", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/strided_slice_1_switch/_43", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/time_switch/_39", "^StatefulPartitionedCall/model/lstm/while/loop_body_control/_45", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/maximum_iterations_switch/_38", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_1_switch/_42", "^StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_switch/_41", "^StatefulPartitionedCall/model/lstm/while/enter/_24", "^StatefulPartitionedCall/model/lstm/while/enter/_25", "^StatefulPartitionedCall/model/lstm/while/enter/_26"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model/lstm/while/exit/_49", "StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/while/body/_15/input/_177", "op": "Identity", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/time_switch/_39:1", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/while/enter/_24", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/while/enter/_25", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/model/lstm/while/enter/_26", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model/lstm/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/loop_counter_switch/_37:1", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model/lstm/while/body/_15/input/_177", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_44:1", "Func/StatefulPartitionedCall/model/lstm/while/body/_15/input/_177", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_switch/_41:1", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd/ReadVariableOp", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul/ReadVariableOp", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/Shape_1", "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack", "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack_1", "StatefulPartitionedCall/model/lstm_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model/lstm/transpose_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/MatMul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/model/lstm/while/next_iteration/_61", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/strided_slice_1_switch/_43:1", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/next_iteration/_62", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/TensorArrayUnstack/TensorListFromTensor_switch/_44:1", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add_1", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/while/maximum_iterations_switch/_38:1", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/NoOp", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/input_control_node/_174"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/add", "^Func/StatefulPartitionedCall/model/lstm/while/body/_15/output_control_node/_197", "^StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model/lstm_1/strided_slice_1"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/lstm_1/Shape", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/model/lstm_1/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/add", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm_1/strided_slice", "StatefulPartitionedCall/model/lstm_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model/lstm_1/strided_slice", "StatefulPartitionedCall/model/lstm_1/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split", "op": "Split", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split/split_dim", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm_1/zeros_1/packed", "StatefulPartitionedCall/model/lstm_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model/lstm_1/zeros/packed", "StatefulPartitionedCall/model/lstm_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/leaky_re_lu/LeakyRelu", "op": "LeakyRelu", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split:2"], "attr": {"T": {"type": "DT_FLOAT"}, "alpha": {"f": 0.2}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/LoopControlInputs/_76", "op": "NoOp", "input": ["^StatefulPartitionedCall/model/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/model/lstm_1/zeros_1", "^StatefulPartitionedCall/model/lstm_1/zeros", "^StatefulPartitionedCall/model/lstm_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/Sigmoid_1", "StatefulPartitionedCall/model/lstm/while/StatefulPartitionedCall/model/lstm/zeros_1_switch/_42:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/Sigmoid", "StatefulPartitionedCall/model/lstm/while/body/_15/model/lstm/while/lstm_cell/leaky_re_lu/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/model/lstm_1/while/LoopControlInputs/_76"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/zeros_1", "^StatefulPartitionedCall/model/lstm_1/while/LoopControlInputs/_76"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model/lstm_1/while/enter/_68", "op": "Enter", "input": ["StatefulPartitionedCall/model/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/model/lstm_1/while/LoopControlInputs/_76"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWwvbHN0bV8xL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": 